[
    {
      "Ref": "V - x",
      "IdentifiedIssue": "Sensitive administrative page is not restricted to specific users & IP addresses",
      "Impact": "AIC",
      "Criticality": "High",
      "Exploitability": "Technical",
      "Perimetre": [],
      "Description": "Access to confidential and administrative pages is publicly exposed.",
      "Risks": "An attacker can access critical functionalities, or conduct brute force attacks, authentication bypass which might give him unauthorized administrative access disclosing/modifying confidential data.",
      "Recommendations": "All accesses to sensitive pages should have an access list with restriction to specific users & IP addresses."
    },
    {
      "Ref": "V - x",
      "IdentifiedIssue": "Critical Service Publicly Exposed (MySQL)",
      "Impact": "AIC",
      "Criticality": "High",
      "Exploitability": "Technical",
      "Perimetre": [],
      "Description": "MySQL service is enabled on the system and is accessible publicly.",
      "Risks": "Publicly exposed services and default settings can lead to unauthorized access and denial of service over the exposed servers.",
      "Recommendations": "Disable public access to sensitive services and restrict access through VPN or IP whitelisting to authorized entities."
    },
    {
      "Ref": "V - x",
      "IdentifiedIssue": "SSL Certificate expired",
      "Impact": "IC",
      "Criticality": "High",
      "Exploitability": "Technical",
      "Perimetre": [],
      "Description": "The remote server's SSL certificate has already expired.",
      "Risks": "Minimizes level of confidence for users and increases the probability of Man-in-the-Middle attacks.",
      "Recommendations": "Purchase or generate a new SSL certificate to replace the existing one."
    },
    {
      "Ref": "V - x",
      "IdentifiedIssue": "Directory Listing",
      "Impact": "AIC",
      "Criticality": "High",
      "Exploitability": "Technical",
      "Perimetre": [],
      "Description": "The web server is configured to display the list of files contained in this directory",
      "Risks": "A user/attacker can view a list of all files from this directory possibly exposing sensitive information.",
      "Recommendations": "Disable indexing on critical directories and forbid web access."
    },
    {
      "Ref": "V - x",
      "IdentifiedIssue": "Traffic sent in clear text (over HTTP)",
      "Impact": "IC",
      "Criticality": "High",
      "Exploitability": "Hacker",
      "Perimetre": [],
      "Description": "Traffic is transmitted over an unencrypted channel. This information should always be transferred via an encrypted channel (HTTPS) to avoid being intercepted by malicious users.",
      "Risks": "An attacker may be able to read and manipulate traffic by intercepting an unencrypted HTTP connection.",
      "Recommendations": "Use encrypted channel (HTTPS) with HSTS."
    },
    {
      "Ref": "V - x",
      "IdentifiedIssue": "Unsecure protocols are being used (HTTP, POP3, SMTP)",
      "Impact": "AC",
      "Criticality": "High",
      "Exploitability": "Hacker",
      "Perimetre": [],
      "Description": "The HTTP, POP3 and SMTP protocols are being used.",
      "Risks": "Requests could be tampered or credentials sent over these services could be subject for interception.",
      "Recommendations": "Enforce the use the secure protocol version of HTTP, POP3 and SMTP such as HTTPS, POP3S and SMTPS which are already enabled."
    },
    {
      "Ref": "V - x",
      "IdentifiedIssue": "Web Application susceptible to Man in the Middle Attack",
      "Impact": "C",
      "Criticality": "Medium",
      "Exploitability": "Technical",
      "Perimetre": [],
      "Description": "The web gateway traffic is not encrypted with a 2nd layer of encryption with no HSTS enforced.",
      "Risks": "An attacker may be able to break the SSL encryption by man in the middle attack and tamper with the data.",
      "Recommendations": "Enforce HSTS and/or encrypt all traffic using 2nd layer encryption."
    },
    {
      "Ref": "V - x",
      "IdentifiedIssue": "Unused ports are kept enabled",
      "Impact": "AIC",
      "Criticality": "Medium",
      "Exploitability": "Hacker",
      "Perimetre": [],
      "Description": "Unused ports are kept enabled.",
      "Risks": "The open ports can trigger several types of attacks on the network such as denial of service and network flooding.",
      "Recommendations": "Disable the unused ports and services."
    },
    {
      "Ref": "V - x",
      "IdentifiedIssue": "OpenSSL AES-NI Padding Oracle MitM Information Disclosure",
      "Impact": "C",
      "Criticality": "Medium",
      "Exploitability": "Hacker",
      "Perimetre": [],
      "Description": "The remote host is affected by a man-in-the-middle (MitM) information disclosure vulnerability due to an error in the implementation of ciphersuites that use AES in CBC mode with HMAC-SHA1 or HMAC-SHA256.",
      "Risks": "The implementation is specially written to use the AES acceleration available in x86/amd64 processors (AES-NI). The error messages returned by the server allow a man-in-the-middle attacker to conduct a padding oracle attack, resulting in the ability to decrypt network traffic.",
      "Recommendations": "Upgrade to OpenSSL version 1.0.1t / 1.0.2h or later."
    },
    {
      "Ref": "V - x",
      "IdentifiedIssue": "Weak SSL Versions Protocol Detection",
      "Impact": "C",
      "Criticality": "Medium",
      "Exploitability": "Hacker",
      "Perimetre": [],
      "Description": "The remote service accepts connections encrypted using versions older than TLS v1.2, which are susceptible to different attacks.",
      "Risks": "An attacker may be able to exploit these issues to conduct man-in-the-middle attacks or decrypt communications between the affected service and clients.",
      "Recommendations": "Disable TLSv1.0 and TLSv1.1 and use TLS v1.2 instead."
    },
    {
      "Ref": "V - x",
      "IdentifiedIssue": "HTTP ‘OPTIONS’ Method Enabled",
      "Impact": "A I",
      "Criticality": "Low",
      "Exploitability": "Hacker",
      "Perimetre": [],
      "Description": "HTTP OPTIONS method is enabled on the web server. The OPTIONS method provides a list of the methods that are supported by the web server; it represents a request for information about the communication options available on the request/response chain identified by the Request-URI.",
      "Risks": "The OPTIONS method may expose sensitive information that may help a malicious user to prepare more advanced attacks.",
      "Recommendations": "Disable OPTIONS method on all web servers."
    },
    {
      "Ref": "V - x",
      "IdentifiedIssue": "Weak Signature Algorithm",
      "Impact": "IC",
      "Criticality": "Low",
      "Exploitability": "Hacker",
      "Perimetre": [],
      "Description": "The CA SSL certificate chain that has been signed using a cryptographically weak hashing algorithm (SHA1). These signature algorithms are known to be vulnerable to collision attacks.",
      "Risks": "An attacker can exploit this to generate another certificate with the same digital signature, allowing an attacker to masquerade as the affected service.",
      "Recommendations": "Contact the Certificate Authority to have the certificate reissued with strong hashing algorithm."
    },
    {
      "Ref": "V - x",
      "IdentifiedIssue": "Exposition publique de l'ensemble des routes de l'API REST",
      "Impact": "CIA",
      "Criticality": "Medium",
      "Exploitability": "Technique",
      "Perimetre": [],
      "Description": "Le site WordPress audité permet l'accès non authentifié à l’endpoint /wp-json/, exposant l'ensemble des routes REST disponibles. Cela inclut les endpoints générés par les plugins installés (ex : Yoast, WPForms, CookieYes), donnant une visibilité complète sur les fonctionnalités internes du site. Cette configuration facilite la phase de reconnaissance pour un attaquant, lui permettant d’identifier les structures de données, les routes exploitables, et potentiellement des fonctionnalités sensibles.",
      "Risks": "Un attaquant peut exploiter cette visibilité pour cartographier le site, identifier les plugins installés (et leurs versions), cibler des routes vulnérables, ou accéder à des données exposées via des endpoints mal configurés. Cela peut conduire à des fuites d’information, à la compromission de comptes via l’abus d’endpoints de login ou de soumission de formulaire, ou encore à des attaques ciblées sur des plugins connus comme vulnérables.",
      "Recommendations": "Limiter l’accès à l’API REST uniquement aux utilisateurs authentifiés, sauf pour les fonctionnalités strictement nécessaires. Cela peut se faire à l’aide de plugins comme 'Disable REST API' ou en ajoutant des filtres personnalisés dans le thème. Il est également recommandé de désactiver les routes inutilisées, d’effectuer des revues régulières de sécurité sur les plugins actifs, et de surveiller l’utilisation des APIs via un WAF ou des outils de journalisation."
    },
     {
      "Ref": "V - x",
      "IdentifiedIssue": "test",
      "Impact": "IC",
      "Criticality": "Low",
      "Exploitability": "Hacker",
      "Perimetre": [],
      "Description": "The CA SSL certificate chain that has been signed using a cryptographically weak hashing algorithm (SHA1). These signature algorithms are known to be vulnerable to collision attacks.",
      "Risks": "An attacker can exploit this to generate another certificate with the same digital signature, allowing an attacker to masquerade as the affected service.",
      "Recommendations": "Contact the Certificate Authority to have the certificate reissued with strong hashing algorithm."
    },
     {
      "Ref": "V - x",
      "IdentifiedIssue": "test2",
      "Impact": "IC",
      "Criticality": "Low",
      "Exploitability": "Hacker",
      "Perimetre": [],
      "Description": "The CA SSL certificate chain that has been signed using a cryptographically weak hashing algorithm (SHA1). These signature algorithms are known to be vulnerable to collision attacks.",
      "Risks": "An attacker can exploit this to generate another certificate with the same digital signature, allowing an attacker to masquerade as the affected service.",
      "Recommendations": "Contact the Certificate Authority to have the certificate reissued with strong hashing algorithm."
    }

  ]
  
